#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

aws_default_vpc_dhcp_options.default: Refreshing state... [id=dopt-0308d4ebeec7ebf9c]
aws_vpc.main: Refreshing state... [id=vpc-010dcff9b549d264f]
aws_key_pair.main: Refreshing state... [id=mac-keypair]
aws_s3_bucket.website: Refreshing state... [id=portfolio-prod-website]
aws_s3_bucket_website_configuration.website: Refreshing state... [id=portfolio-prod-website]
aws_s3_bucket_public_access_block.website: Refreshing state... [id=portfolio-prod-website]
aws_cloudfront_distribution.main: Refreshing state... [id=E2U6VGNQ4WZZLL]
aws_s3_bucket_policy.website: Refreshing state... [id=portfolio-prod-website]
aws_subnet.public: Refreshing state... [id=subnet-0e0d18de26fe9b57e]
aws_internet_gateway.main: Refreshing state... [id=igw-0bd97a226e607719e]
aws_security_group.ec2_public: Refreshing state... [id=sg-00c879139d2ed8945]
aws_route_table.public: Refreshing state... [id=rtb-0f8523643b80040fd]
aws_instance.app: Refreshing state... [id=i-04c0993838cff7f83]
aws_route_table_association.public: Refreshing state... [id=rtbassoc-084f9946195368129]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_s3_bucket.website has changed
  ~ resource "aws_s3_bucket" "website" {
        id                          = "portfolio-prod-website"
      ~ tags                        = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "portfolio"
        }
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_acm_certificate.portfolio_cert will be created
  + resource "aws_acm_certificate" "portfolio_cert" {
      + arn                       = (known after apply)
      + domain_name               = "vphatfla.me"
      + domain_validation_options = [
          + {
              + domain_name           = "*.vphatfla.me"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "vphatfla.me"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "www.vphatfla.me"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.vphatfla.me",
          + "vphatfla.me",
          + "www.vphatfla.me",
        ]
      + tags                      = {
          + "Name" = "portfolio-cert"
        }
      + tags_all                  = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "portfolio-cert"
          + "Project"     = "portfolio"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"

      + options (known after apply)
    }

  # aws_cloudfront_distribution.main will be updated in-place
  ~ resource "aws_cloudfront_distribution" "main" {
      ~ aliases                         = [
          + "vphatfla.me",
        ]
        id                              = "E2U6VGNQ4WZZLL"
      ~ tags                            = {
          - "Environment" = "prod" -> null
          - "ManagedBy"   = "Terraform" -> null
          - "Project"     = "portfolio" -> null
        }
      ~ tags_all                        = {
          - "Environment" = "prod"
          - "ManagedBy"   = "Terraform"
          - "Project"     = "portfolio"
        } -> (known after apply)
        # (20 unchanged attributes hidden)

      ~ viewer_certificate {
          + acm_certificate_arn            = (known after apply)
          ~ cloudfront_default_certificate = true -> false
          ~ minimum_protocol_version       = "TLSv1" -> "TLSv1.2_2021"
          + ssl_support_method             = "sni-only"
            # (1 unchanged attribute hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # aws_instance.app will be updated in-place
  ~ resource "aws_instance" "app" {
        id                                   = "i-04c0993838cff7f83"
      ~ tags                                 = {
          - "Environment" = "prod" -> null
          - "ManagedBy"   = "Terraform" -> null
            "Name"        = "portfolio-ec2"
          - "Project"     = "portfolio" -> null
        }
      ~ tags_all                             = {
          - "Environment" = "prod" -> null
          - "ManagedBy"   = "Terraform" -> null
          - "Project"     = "portfolio" -> null
            # (1 unchanged element hidden)
        }
        # (38 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # aws_internet_gateway.main will be updated in-place
  ~ resource "aws_internet_gateway" "main" {
        id       = "igw-0bd97a226e607719e"
      ~ tags     = {
          - "Environment" = "prod" -> null
          - "ManagedBy"   = "Terraform" -> null
            "Name"        = "portfolio-vpc-igw"
          - "Project"     = "portfolio" -> null
        }
      ~ tags_all = {
          - "Environment" = "prod" -> null
          - "ManagedBy"   = "Terraform" -> null
          - "Project"     = "portfolio" -> null
            # (1 unchanged element hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # aws_key_pair.main will be updated in-place
  ~ resource "aws_key_pair" "main" {
        id              = "mac-keypair"
      ~ tags            = {
          - "Environment" = "prod" -> null
          - "ManagedBy"   = "Terraform" -> null
          - "Project"     = "portfolio" -> null
        }
      ~ tags_all        = {
          - "Environment" = "prod"
          - "ManagedBy"   = "Terraform"
          - "Project"     = "portfolio"
        } -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # aws_route_table.public will be updated in-place
  ~ resource "aws_route_table" "public" {
        id               = "rtb-0f8523643b80040fd"
      ~ tags             = {
          - "Environment" = "prod" -> null
          - "ManagedBy"   = "Terraform" -> null
            "Name"        = "portfolio-public-route-table"
          - "Project"     = "portfolio" -> null
        }
      ~ tags_all         = {
          - "Environment" = "prod" -> null
          - "ManagedBy"   = "Terraform" -> null
          - "Project"     = "portfolio" -> null
            # (1 unchanged element hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # aws_s3_bucket.website will be updated in-place
  ~ resource "aws_s3_bucket" "website" {
        id                          = "portfolio-prod-website"
      ~ tags                        = {
          - "Environment" = "prod" -> null
          - "ManagedBy"   = "Terraform" -> null
          - "Project"     = "portfolio" -> null
        }
      ~ tags_all                    = {
          - "Environment" = "prod"
          - "ManagedBy"   = "Terraform"
          - "Project"     = "portfolio"
        } -> (known after apply)
        # (14 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_security_group.ec2_public will be updated in-place
  ~ resource "aws_security_group" "ec2_public" {
        id                     = "sg-00c879139d2ed8945"
        name                   = "portfolio-ec2-public-sg"
      ~ tags                   = {
          - "Environment" = "prod" -> null
          - "ManagedBy"   = "Terraform" -> null
            "Name"        = "portfolio-ec2-sg"
          - "Project"     = "portfolio" -> null
        }
      ~ tags_all               = {
          - "Environment" = "prod" -> null
          - "ManagedBy"   = "Terraform" -> null
          - "Project"     = "portfolio" -> null
            # (1 unchanged element hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # aws_subnet.public will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-0e0d18de26fe9b57e"
      ~ tags                                           = {
          - "Environment" = "prod" -> null
          - "ManagedBy"   = "Terraform" -> null
            "Name"        = "portfolio-vpc-public-subnet"
          - "Project"     = "portfolio" -> null
        }
      ~ tags_all                                       = {
          - "Environment" = "prod" -> null
          - "ManagedBy"   = "Terraform" -> null
          - "Project"     = "portfolio" -> null
            # (1 unchanged element hidden)
        }
        # (19 unchanged attributes hidden)
    }

  # aws_vpc.main will be updated in-place
  ~ resource "aws_vpc" "main" {
        id                                   = "vpc-010dcff9b549d264f"
      ~ tags                                 = {
          - "Environment" = "prod" -> null
          - "ManagedBy"   = "Terraform" -> null
            "Name"        = "portfolio-vpc"
          - "Project"     = "portfolio" -> null
        }
      ~ tags_all                             = {
          - "Environment" = "prod" -> null
          - "ManagedBy"   = "Terraform" -> null
          - "Project"     = "portfolio" -> null
            # (1 unchanged element hidden)
        }
        # (18 unchanged attributes hidden)
    }

Plan: 1 to add, 9 to change, 0 to destroy.

Changes to Outputs:
  + cert_dns_validation_record = [
      + {
          + domain_name           = "*.vphatfla.me"
          + resource_record_name  = (known after apply)
          + resource_record_type  = (known after apply)
          + resource_record_value = (known after apply)
        },
      + {
          + domain_name           = "vphatfla.me"
          + resource_record_name  = (known after apply)
          + resource_record_type  = (known after apply)
          + resource_record_value = (known after apply)
        },
      + {
          + domain_name           = "www.vphatfla.me"
          + resource_record_name  = (known after apply)
          + resource_record_type  = (known after apply)
          + resource_record_value = (known after apply)
        },
    ]
  ~ portfolio_bucket_name      = {
        id                                   = "portfolio-prod-website"
        tags                                 = {}
      ~ tags_all                             = {
          - Environment = "prod"
          - ManagedBy   = "Terraform"
          - Project     = "portfolio"
        } -> (known after apply)
        # (25 unchanged attributes hidden)
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>